<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Сообщения статусов от сервера
    |--------------------------------------------------------------------------
    |
    | Здесь хранятся список переводов для сообщения статус запроса.
    |
    */
    'messages' => [
        'success_retrieve' => 'Список всех документов успешно был извлечён.',

        'success_create' => 'Документ успешно был создан.',
        'error_create' => 'Произошла ошибка при создании нового документа.',

        'success_update' => 'Документ успешно был обновлён.',
        'error_update' => 'Произошла ошибка при обновлении документа.',

        'success_destroy' => 'Документ успешно был удалён.',
        'error_destroy' => 'Произошла ошибка при удалении документа.',

        'success_found' => 'Документ был успешно найден.',
        'not_found' => 'Документ не был найден.'
    ]
];
